benchmark/go-frameworks/results/20260924-102750/results/get/fiber/r3/20000.txt
Running 40s test @ http://10.128.0.4:8085/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.886ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.891ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.901ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.892ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.880ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.850ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.904ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.850ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.848ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.808ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.874ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.847ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.857ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.993ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms  414.97us   4.66ms   65.00%
    Req/Sec     1.33k   538.32     3.56k    89.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89ms
 75.000%    1.19ms
 90.000%    1.43ms
 99.000%    1.88ms
 99.900%    2.08ms
 99.990%    2.41ms
 99.999%    3.39ms
100.000%    4.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.087     0.000000            1         1.00
       0.332     0.100000        60004         1.11
       0.490     0.200000       119460         1.25
       0.637     0.300000       179444         1.43
       0.770     0.400000       238860         1.67
       0.892     0.500000       298616         2.00
       0.951     0.550000       328263         2.22
       1.011     0.600000       358258         2.50
       1.070     0.650000       388381         2.86
       1.128     0.700000       418290         3.33
       1.186     0.750000       447890         4.00
       1.217     0.775000       462816         4.44
       1.250     0.800000       477721         5.00
       1.285     0.825000       492667         5.71
       1.322     0.850000       507467         6.67
       1.366     0.875000       522275         8.00
       1.395     0.887500       529901         8.89
       1.428     0.900000       537175        10.00
       1.467     0.912500       544657        11.43
       1.510     0.925000       552200        13.33
       1.557     0.937500       559647        16.00
       1.583     0.943750       563376        17.78
       1.611     0.950000       567043        20.00
       1.641     0.956250       570802        22.86
       1.673     0.962500       574443        26.67
       1.710     0.968750       578209        32.00
       1.729     0.971875       580020        35.56
       1.751     0.975000       581950        40.00
       1.773     0.978125       583795        45.71
       1.796     0.981250       585664        53.33
       1.821     0.984375       587485        64.00
       1.835     0.985938       588455        71.11
       1.850     0.987500       589387        80.00
       1.867     0.989062       590319        91.43
       1.885     0.990625       591234       106.67
       1.905     0.992188       592159       128.00
       1.916     0.992969       592614       142.22
       1.929     0.993750       593094       160.00
       1.941     0.994531       593544       182.86
       1.955     0.995313       594007       213.33
       1.972     0.996094       594489       256.00
       1.980     0.996484       594719       284.44
       1.991     0.996875       594953       320.00
       2.003     0.997266       595186       365.71
       2.014     0.997656       595406       426.67
       2.029     0.998047       595644       512.00
       2.037     0.998242       595766       568.89
       2.045     0.998437       595879       640.00
       2.055     0.998633       595996       731.43
       2.065     0.998828       596112       853.33
       2.077     0.999023       596228      1024.00
       2.085     0.999121       596291      1137.78
       2.091     0.999219       596338      1280.00
       2.103     0.999316       596405      1462.86
       2.111     0.999414       596457      1706.67
       2.121     0.999512       596517      2048.00
       2.129     0.999561       596545      2275.56
       2.139     0.999609       596573      2560.00
       2.151     0.999658       596608      2925.71
       2.159     0.999707       596631      3413.33
       2.173     0.999756       596663      4096.00
       2.187     0.999780       596673      4551.11
       2.207     0.999805       596689      5120.00
       2.235     0.999829       596703      5851.43
       2.273     0.999854       596717      6826.67
       2.327     0.999878       596733      8192.00
       2.365     0.999890       596739      9102.22
       2.421     0.999902       596746     10240.00
       2.453     0.999915       596754     11702.86
       2.527     0.999927       596761     13653.33
       2.559     0.999939       596768     16384.00
       2.575     0.999945       596772     18204.44
       2.613     0.999951       596775     20480.00
       2.645     0.999957       596779     23405.71
       2.687     0.999963       596783     27306.67
       2.843     0.999969       596786     32768.00
       2.959     0.999973       596788     36408.89
       3.027     0.999976       596790     40960.00
       3.145     0.999979       596792     46811.43
       3.267     0.999982       596794     54613.33
       3.283     0.999985       596795     65536.00
       3.305     0.999986       596796     72817.78
       3.327     0.999988       596797     81920.00
       3.387     0.999989       596798     93622.86
       3.401     0.999991       596799    109226.67
       3.409     0.999992       596800    131072.00
       3.409     0.999993       596800    145635.56
       3.533     0.999994       596801    163840.00
       3.533     0.999995       596801    187245.71
       3.613     0.999995       596802    218453.33
       3.613     0.999996       596802    262144.00
       3.613     0.999997       596802    291271.11
       4.599     0.999997       596803    327680.00
       4.599     0.999997       596803    374491.43
       4.599     0.999998       596803    436906.67
       4.599     0.999998       596803    524288.00
       4.599     0.999998       596803    582542.22
       4.659     0.999998       596804    655360.00
       4.659     1.000000       596804          inf
#[Mean    =        0.893, StdDeviation   =        0.415]
#[Max     =        4.656, Total count    =       596804]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  796363 requests in 40.01s, 288.60MB read
Requests/sec:  19902.30
Transfer/sec:      7.21MB