benchmark/go-frameworks/results/20260924-102750/results/get/fiber/r3/40000.txt
Running 40s test @ http://10.128.0.4:8085/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.949ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.916ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.965ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.955ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.941ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.946ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.966ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.936ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.966ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.945ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.964ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.958ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.955ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  422.55us   6.59ms   65.01%
    Req/Sec     2.62k   282.28     3.78k    80.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.94ms
 75.000%    1.25ms
 90.000%    1.49ms
 99.000%    1.90ms
 99.900%    2.40ms
 99.990%    4.82ms
 99.999%    6.12ms
100.000%    6.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.086     0.000000            1         1.00
       0.385     0.100000       119837         1.11
       0.545     0.200000       238867         1.25
       0.685     0.300000       358112         1.43
       0.817     0.400000       477762         1.67
       0.943     0.500000       596952         2.00
       1.005     0.550000       657328         2.22
       1.066     0.600000       717026         2.50
       1.127     0.650000       776156         2.86
       1.189     0.700000       835735         3.33
       1.253     0.750000       895257         4.00
       1.287     0.775000       925844         4.44
       1.320     0.800000       955128         5.00
       1.355     0.825000       984778         5.71
       1.393     0.850000      1014810         6.67
       1.437     0.875000      1044804         8.00
       1.462     0.887500      1059766         8.89
       1.489     0.900000      1074171        10.00
       1.520     0.912500      1089277        11.43
       1.554     0.925000      1104135        13.33
       1.593     0.937500      1119162        16.00
       1.614     0.943750      1126431        17.78
       1.637     0.950000      1133847        20.00
       1.663     0.956250      1141454        22.86
       1.691     0.962500      1148904        26.67
       1.723     0.968750      1156332        32.00
       1.740     0.971875      1159968        35.56
       1.760     0.975000      1163839        40.00
       1.781     0.978125      1167494        45.71
       1.805     0.981250      1171246        53.33
       1.832     0.984375      1174887        64.00
       1.848     0.985938      1176774        71.11
       1.865     0.987500      1178644        80.00
       1.885     0.989062      1180514        91.43
       1.907     0.990625      1182331       106.67
       1.933     0.992188      1184208       128.00
       1.946     0.992969      1185116       142.22
       1.962     0.993750      1186066       160.00
       1.980     0.994531      1187025       182.86
       1.999     0.995313      1187921       213.33
       2.023     0.996094      1188857       256.00
       2.037     0.996484      1189312       284.44
       2.055     0.996875      1189807       320.00
       2.075     0.997266      1190280       365.71
       2.097     0.997656      1190713       426.67
       2.131     0.998047      1191190       512.00
       2.151     0.998242      1191416       568.89
       2.181     0.998437      1191642       640.00
       2.225     0.998633      1191884       731.43
       2.297     0.998828      1192111       853.33
       2.417     0.999023      1192343      1024.00
       2.497     0.999121      1192458      1137.78
       2.579     0.999219      1192577      1280.00
       2.693     0.999316      1192691      1462.86
       2.815     0.999414      1192809      1706.67
       2.991     0.999512      1192925      2048.00
       3.105     0.999561      1192982      2275.56
       3.243     0.999609      1193040      2560.00
       3.383     0.999658      1193099      2925.71
       3.559     0.999707      1193158      3413.33
       3.753     0.999756      1193215      4096.00
       3.893     0.999780      1193244      4551.11
       4.009     0.999805      1193273      5120.00
       4.155     0.999829      1193304      5851.43
       4.295     0.999854      1193333      6826.67
       4.511     0.999878      1193361      8192.00
       4.727     0.999890      1193375      9102.22
       4.863     0.999902      1193391     10240.00
       4.979     0.999915      1193405     11702.86
       5.167     0.999927      1193419     13653.33
       5.335     0.999939      1193435     16384.00
       5.463     0.999945      1193441     18204.44
       5.591     0.999951      1193448     20480.00
       5.671     0.999957      1193456     23405.71
       5.699     0.999963      1193463     27306.67
       5.743     0.999969      1193470     32768.00
       5.783     0.999973      1193474     36408.89
       5.803     0.999976      1193477     40960.00
       5.903     0.999979      1193481     46811.43
       5.935     0.999982      1193486     54613.33
       6.011     0.999985      1193488     65536.00
       6.047     0.999986      1193490     72817.78
       6.079     0.999988      1193492     81920.00
       6.123     0.999989      1193494     93622.86
       6.171     0.999991      1193496    109226.67
       6.191     0.999992      1193497    131072.00
       6.199     0.999993      1193498    145635.56
       6.251     0.999994      1193499    163840.00
       6.271     0.999995      1193500    187245.71
       6.287     0.999995      1193501    218453.33
       6.347     0.999996      1193504    262144.00
       6.347     0.999997      1193504    291271.11
       6.347     0.999997      1193504    327680.00
       6.347     0.999997      1193504    374491.43
       6.347     0.999998      1193504    436906.67
       6.347     0.999998      1193504    524288.00
       6.347     0.999998      1193504    582542.22
       6.519     0.999998      1193505    655360.00
       6.519     0.999999      1193505    748982.86
       6.519     0.999999      1193505    873813.33
       6.519     0.999999      1193505   1048576.00
       6.519     0.999999      1193505   1165084.44
       6.595     0.999999      1193506   1310720.00
       6.595     1.000000      1193506          inf
#[Mean    =        0.947, StdDeviation   =        0.423]
#[Max     =        6.592, Total count    =      1193506]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1594683 requests in 40.00s, 577.91MB read
Requests/sec:  39869.66
Transfer/sec:     14.45MB